# DataFrame Eleman İşlemleri

In [1]:
import numpy as np

In [2]:
s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

In [4]:
sozluk = {"var1":s1,"var2":s2,"var3":s3}

In [5]:
sozluk

{'var1': array([6, 4, 5, 8, 2]),
 'var2': array([3, 8, 3, 4, 0]),
 'var3': array([9, 7, 5, 0, 2])}

In [6]:
import pandas as pd

In [7]:
df = pd.DataFrame(sozluk)

In [8]:
df

   var1  var2  var3
0     6     3     9
1     4     8     7
2     5     3     5
3     8     4     0
4     2     0     2

In [9]:
df[0:1]

   var1  var2  var3
0     6     3     9

In [10]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [12]:
df.index = ("a","b","c","d","e")

In [13]:
df

   var1  var2  var3
a     6     3     9
b     4     8     7
c     5     3     5
d     8     4     0
e     2     0     2

In [14]:
df["c":"e"]

   var1  var2  var3
c     5     3     5
d     8     4     0
e     2     0     2

In [15]:
#Silme İşlemi

In [16]:
df.drop("a", axis = 0)

   var1  var2  var3
b     4     8     7
c     5     3     5
d     8     4     0
e     2     0     2

Silme işlemi yapıldığı zaman ana tabloda bir değişiklik olmaz.
Fakat **inplace=True** ile ana tablodan kalıcı olarak bir değişiklik sağlarız.

In [17]:
df

   var1  var2  var3
a     6     3     9
b     4     8     7
c     5     3     5
d     8     4     0
e     2     0     2

In [18]:
df.drop("a", axis = 0, inplace = True)

In [19]:
df

   var1  var2  var3
b     4     8     7
c     5     3     5
d     8     4     0
e     2     0     2

In [20]:
#Fancy ile Silme

In [21]:
l =["c","e"]

In [22]:
df.drop(l,axis = 0)

   var1  var2  var3
b     4     8     7
d     8     4     0

**Fancy ile silmek istediğimiz satır isimlerini bir liste içinde tanımlayarak işlemi gerçekleştiriyoruz.**

In [23]:
#Değişkenler için Sorgulama

In [24]:
df

   var1  var2  var3
b     4     8     7
c     5     3     5
d     8     4     0
e     2     0     2

In [25]:
"var1" in df

True

In [26]:
l = ["var1","var4","var2"]

In [27]:
for i in l:
    print( i in df)

True
False
True

**Sütun bazında bir sorgulama**

In [28]:
df

   var1  var2  var3
b     4     8     7
c     5     3     5
d     8     4     0
e     2     0     2

In [29]:
df["var4"] = df["var1"] / df["var2"]

In [30]:
df

   var1  var2  var3      var4
b     4     8     7  0.500000
c     5     3     5  1.666667
d     8     4     0  2.000000
e     2     0     2       inf

In [31]:
#Değişken Silme

In [32]:
df.drop("var4", axis=1)

   var1  var2  var3
b     4     8     7
c     5     3     5
d     8     4     0
e     2     0     2

In [33]:
df

   var1  var2  var3      var4
b     4     8     7  0.500000
c     5     3     5  1.666667
d     8     4     0  2.000000
e     2     0     2       inf

In [34]:
df.drop("var4", axis=1, inplace=True)

In [35]:
df

   var1  var2  var3
b     4     8     7
c     5     3     5
d     8     4     0
e     2     0     2